app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status` = 'Menunggu'
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status` = 'Diterima'
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
WHERE `status` = 'Ditolak'
SELECT *
FROM `pendaftaran`
ORDER BY `id` DESC
 LIMIT 5
---
    public function index()
    {
        $model = new PendaftaranModel();

        $data = [
            'title'     => 'Dashboard',
            'total'     => $model->countAllResults(),
            'menunggu'  => $model->where('status', 'Menunggu')->countAllResults(),
            'diterima'  => $model->where('status', 'Diterima')->countAllResults(),
            'ditolak'   => $model->where('status', 'Ditolak')->countAllResults(),
            'terbaru'   => $model->orderBy('id', 'DESC')->findAll(5),