app/Models/UserModel.php

    public function findByUsername(string $username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1